Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.5.87/saml21a1/edc/ATSAML21E18A.PIC
      <edc:SFRDef edc:_addr="0x40000005" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000006" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PLRDY" edc:desc="Performance Level Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000007" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000008" edc:access="nnnnnnnnn-nn--nn" edc:cname="STDBYCFG" edc:impl="0xFFB3" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PDCFG" edc:desc="Power Domain Configuration" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="All power domains switching is handled by hardware." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PD0" edc:desc="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PD01" edc:desc="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PD012" edc:desc="All power domains are forced ACTIVE." edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DPGPD0" edc:desc="Dynamic Power Gating for PD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPGPD1" edc:desc="Dynamic Power Gating for PD1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AVREGSD" edc:desc="Automatic VREG Switching Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINKPD" edc:desc="Linked Power Domain" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Power domains are not linked" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PD01" edc:desc="PD0 and PD1 power domains are linked" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="PD12" edc:desc="PD1 and PD2 power domains are linked" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="PD012" edc:desc="All power domains are linked" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BBIASHS" edc:desc="Back Bias for HMCRAMCHS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BBIASLP" edc:desc="Back Bias for HMCRAMCLP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BBIASPP" edc:desc="Back Bias for PicoPram" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000000A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4000000C" edc:access="nnnnnnnn" edc:cname="PWSAKDLY" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="DLYVAL" edc:desc="Delay Value" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="IGNACK" edc:desc="Ignore Acknowledge" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000000D" edc:offset="0x3F3"/>
      <edc:SFRDef edc:_addr="0x40000400" edc:access="---n-n--" edc:cname="CTRLA" edc:impl="0x14" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:desc="Clock Failure Detector Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMCLK" edc:desc="Emergency Clock Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000401" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:desc="Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000402" edc:access="------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFD" edc:desc="Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
