Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.5.87/saml21a1/edc/ATSAML21E18A.PIC
      <edc:SFRDef edc:access="-------nnnnnnnnn" edc:addr="0x42000C28" edc:cname="DATA" edc:impl="0x1FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0x42000C0C" edc:cname="BAUD" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="BAUD" edc:desc="Baud Rate Value" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="-3"/>
            <edc:SFRFieldDef edc:cname="FP" edc:desc="Fractional Part" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x42000C0E" edc:cname="RXPL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="RXPL" edc:desc="Receive Pulse Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0x42000C30" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:desc="Debug Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000C14" edc:cname="INTENCLR" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000C16" edc:cname="INTENSET" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n-nnnnnn" edc:addr="0x42000C18" edc:cname="INTFLAG" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:desc="Receive Start Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear To Send Input Change Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----------nnnnnn" edc:addr="0x42000C1A" edc:cname="STATUS" edc:impl="0x3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Parity Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Clear To Send" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISF" edc:desc="Inconsistent Sync Field" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:desc="Collision Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----------------------------rrr" edc:addr="0x42000C1C" edc:cname="SYNCBUSY" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM3/I2CS">
      <edc:SFRDef edc:access="-n--n-nnn-nn---n--------n--nnnnn" edc:addr="0x42000C00" edc:cname="CTRLA" edc:impl="0x4BB1009F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PINOUT" edc:desc="Pin Usage" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDAHOLD" edc:desc="SDA Hold Time" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEXTTOEN" edc:desc="Slave SCL Low Extend Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="Transfer Speed" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLSM" edc:desc="SCL Clock Stretch Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOWTOUTEN" edc:desc="SCL Low Timeout Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------nnnnn---nnn--------" edc:addr="0x42000C04" edc:cname="CTRLB" edc:impl="0x7C700" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Smart Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCMD" edc:desc="PMBus Group Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AACKEN" edc:desc="Automatic Address Acknowledge" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ACKACT" edc:desc="Acknowledge Action" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnnnnnnnnn-n----nnnnnnnnnnn" edc:addr="0x42000C24" edc:cname="ADDR" edc:impl="0x7FE87FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="GENCEN" edc:desc="General Call Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TENBITEN" edc:desc="Ten Bit Addressing Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0x42000C28" edc:cname="DATA" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x42000C14" edc:cname="INTENCLR" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM3">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
